#include <iostream>
#include <string>
using namespace std;

//Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.

int main() {
    
    double(x);
    cout << "Enter ur number: ";
    cin >> x;
    if (x>=0)
    {
        cout << "Your number is positive"<<endl;
    }
    else
    {
        cout << "Your number is negative" << endl;
    }
    return 0;
}


